[
    {
        "id": 100,
        "title": "Building a Minimalist Engineering Portfolio with React & GitHub Actions",
        "content": "## Preface: The Problem with Portfolios\nMost developer portfolios are cluttered. They focus on flashy 'About Me' sections and generic project cards that don't tell a story. As a Senior Engineer, I wanted my portfolio to reflect my actual work: technical writing, architectural decisions, and clean code.\n\n## The Stack\n- **Core**: React 18 + Vite (for speed)\n- **Styling**: TailwindCSS (for utility-first minimalist design)\n- **Animations**: Framer Motion (only for subtle, meaningful transitions)\n- **Deployment**: GitHub Pages via GitHub Actions\n\n## 1. Design Philosophy: 'Less is More'\nI started with an 'Interstellar' theme but realized it was too distracting. I pivoted to a 'Data-First' aesthetic:\n- **Typography**: Inter (Clean, readable)\n- **Colors**: Deep Matte Black (#050505) with 'Matrix Green' accents for key actions.\n- **Content**: Removed the dedicated 'About' page. My career summary is the Hero section. My code is my identity.\n\n## 2. The 'Engineering Log' Architecture\nInstead of a CMS, I opted for a git-backed 'File-as-Database' approach. The blog posts are stored in a simple JSON file. This allows me to write posts in my code editor and version control them alongside the application code.\n\n```javascript\n// src/data/blog_posts.json\n[\n  {\n    \"id\": 1,\n    \"title\": \"Optimization Techniques...\",\n    \"content\": \"...\"\n  }\n]\n```\n\nThis 'Stateless' architecture means no database costs, no backend maintenance, and instant load times. The `EngineeringLog` component simply maps over this data, with client-side pagination handled by a simple slice operation.\n\n## 3. CI/CD with GitHub Actions\nManually building and dragging folders is prone to error. I automated the deployment using GitHub Actions.\n\n### The Workflow (`deploy.yml`)\nWe use a custom workflow that triggers on every push to `main`. It sets up Node.js, installs dependencies (`npm ci`), builds the project (`npm run build`), and uploads the `dist` artifact directly to GitHub Pages.\n\n```yaml\nname: Deploy to GitHub Pages\njobs:\n  deploy:\n    permissions:\n      pages: write\n      id-token: write\n    steps:\n      - uses: actions/checkout@v4\n      - run: npm run build\n      - uses: actions/upload-pages-artifact@v3\n        with: { path: './dist' }\n      - uses: actions/deploy-pages@v4\n```\n\n## Conclusion\nBy treating my portfolio as a software product, I created a platform that is strictly focused on content delivery. It's fast, free to host, and allows me to 'blog as code'.",
        "tag": "DevOps",
        "date": "2025-12-11"
    },
    {
        "id": 8,
        "title": "WebGL 2.0: Moving beyond the fixed function pipeline",
        "content": "With WebGL 2.0 now widely supported, we can leverage Transform Feedback and 3D Textures on the web. This article explores a particle system implementation that runs entirely on the GPU...",
        "tag": "Graphics",
        "date": "2024-08-15"
    },
    {
        "id": 7,
        "title": "React Server Components: A Skeptic's Guide",
        "content": "The shift to server-side rendering is cyclical. However, RSCs offer a unique value prop for reducing bundle size. Here is my analysis after porting a large dashboard to Next.js 14...",
        "tag": "Frontend",
        "date": "2024-07-22"
    },
    {
        "id": 6,
        "title": "Designing for Offline-First with CRDTs",
        "content": "Conflict-free Replicated Data Types are magical but complex. I break down how we used Yjs to build a collaborative text editor that works flawlessly in subway tunnels...",
        "tag": "Architecture",
        "date": "2024-06-10"
    },
    {
        "id": 5,
        "title": "The Art of Code Review",
        "content": "Code reviews are not just about finding bugs; they are a knowledge transfer mechanism. I share my checklist for reviewing PRs that focuses on readability and maintainability over nitpicks...",
        "tag": "Leadership",
        "date": "2024-05-05"
    },
    {
        "id": 1,
        "title": "TheCost of Abstraction: optimizing Vulkan Render Passes",
        "content": "While high-level graphics APIs offer convenience, they often hide the cost of pipeline state changes. In this deep dive, I explore how manual descriptor set management and push constants reduced draw call overhead by 40% in our custom game engine...",
        "tag": "Graphics",
        "date": "2024-12-10"
    },
    {
        "id": 2,
        "title": "Scaling Mobile Architectures: Feature-First vs Layer-First",
        "content": "As mobile teams grow beyond 20 engineers, the traditional MVC/MVVM layer-based folder structure starts to crumble. We transitioned to a feature-based module federation approach, allowing independent builds and 50% faster CI times...",
        "tag": "Architecture",
        "date": "2024-11-28"
    },
    {
        "id": 3,
        "title": "Zero-Allocation Parsing in Real-time Audio Processing",
        "content": "Garbage Collection pauses are the enemy of low-latency audio. By utilizing flat buffers and stack allocation tactics in our DSP chain, we eliminated audio glitches on low-end Android devices...",
        "tag": "Performance",
        "date": "2024-11-15"
    },
    {
        "id": 4,
        "title": "Mentoring Senior Engineers: From Code to Context",
        "content": "Moving from Senior to Staff Engineer requires a shift from 'how' to 'why'. This post outlines my framework for mentoring high-performers, focusing on system design, trade-off analysis, and cross-team influence...",
        "tag": "Leadership",
        "date": "2024-10-30"
    }
]